BitNibble/Source_Library/stm32f446lib/Library/Src/stm32446dma.c
/******************************************************************************
	STM32 446 DMA
Author: Sergio Santos 
	<sergio.salazar.santos@gmail.com>
License: GNU General Public License
Hardware: STM32-446
Date: 27062023
Comment:

*******************************************************************************/
/*** File Library ***/
#include "stm32446mapping.h"
#include "stm32446dma.h"

static uint32_t time_out;

/*** File Procedure & Function Header ***/
/*** REG INIC ***/
STM32446DMA_sr stm32446_dma1_sr_inic(void);
STM32446DMA_STREAM_cr stm32446_dma1_stream0_cr_inic(void);
void stm32446_dma1_stream0_ndt(uint16_t value);
void stm32446_dma1_stream0_par(volatile long unsigned int periferal_addr);
void stm32446_dma1_stream0_m0a(volatile long unsigned int mem0_addr);
void stm32446_dma1_stream0_m1a(volatile long unsigned int mem1_addr);
STM32446DMA_STREAM_fcr stm32446_dma1_stream0_fcr_inic(void);
STM32446DMA_STREAM_cr stm32446_dma1_stream1_cr_inic(void);
void stm32446_dma1_stream1_ndt(uint16_t value);
void stm32446_dma1_stream1_par(volatile long unsigned int periferal_addr);
void stm32446_dma1_stream1_m0a(volatile long unsigned int mem0_addr);
void stm32446_dma1_stream1_m1a(volatile long unsigned int mem1_addr);
STM32446DMA_STREAM_fcr stm32446_dma1_stream1_fcr_inic(void);
STM32446DMA_STREAM_cr stm32446_dma1_stream2_cr_inic(void);
void stm32446_dma1_stream2_ndt(uint16_t value);
void stm32446_dma1_stream2_par(volatile long unsigned int periferal_addr);
void stm32446_dma1_stream2_m0a(volatile long unsigned int mem0_addr);
void stm32446_dma1_stream2_m1a(volatile long unsigned int mem1_addr);
STM32446DMA_STREAM_fcr stm32446_dma1_stream2_fcr_inic(void);
STM32446DMA_STREAM_cr stm32446_dma1_stream3_cr_inic(void);
void stm32446_dma1_stream3_ndt(uint16_t value);
void stm32446_dma1_stream3_par(volatile long unsigned int periferal_addr);
void stm32446_dma1_stream3_m0a(volatile long unsigned int mem0_addr);
void stm32446_dma1_stream3_m1a(volatile long unsigned int mem1_addr);
STM32446DMA_STREAM_fcr stm32446_dma1_stream3_fcr_inic(void);
STM32446DMA_STREAM_cr stm32446_dma1_stream4_cr_inic(void);
void stm32446_dma1_stream4_ndt(uint16_t value);
void stm32446_dma1_stream4_par(volatile long unsigned int periferal_addr);
void stm32446_dma1_stream4_m0a(volatile long unsigned int mem0_addr);
void stm32446_dma1_stream4_m1a(volatile long unsigned int mem1_addr);
STM32446DMA_STREAM_fcr stm32446_dma1_stream4_fcr_inic(void);
STM32446DMA_STREAM_cr stm32446_dma1_stream5_cr_inic(void);
void stm32446_dma1_stream5_ndt(uint16_t value);
void stm32446_dma1_stream5_par(volatile long unsigned int periferal_addr);
void stm32446_dma1_stream5_m0a(volatile long unsigned int mem0_addr);
void stm32446_dma1_stream5_m1a(volatile long unsigned int mem1_addr);
STM32446DMA_STREAM_fcr stm32446_dma1_stream5_fcr_inic(void);
STM32446DMA_STREAM_cr stm32446_dma1_stream6_cr_inic(void);
void stm32446_dma1_stream6_ndt(uint16_t value);
void stm32446_dma1_stream6_par(volatile long unsigned int periferal_addr);
void stm32446_dma1_stream6_m0a(volatile long unsigned int mem0_addr);
void stm32446_dma1_stream6_m1a(volatile long unsigned int mem1_addr);
STM32446DMA_STREAM_fcr stm32446_dma1_stream6_fcr_inic(void);
STM32446DMA_STREAM_cr stm32446_dma1_stream7_cr_inic(void);
void stm32446_dma1_stream7_ndt(uint16_t value);
void stm32446_dma1_stream7_par(volatile long unsigned int periferal_addr);
void stm32446_dma1_stream7_m0a(volatile long unsigned int mem0_addr);
void stm32446_dma1_stream7_m1a(volatile long unsigned int mem1_addr);
STM32446DMA_STREAM_fcr stm32446_dma1_stream7_fcr_inic(void);
STM32446DMA_func stm32446_dma1_func_inic(void);
STM32446DMA_sr stm32446_dma2_sr_inic(void);
STM32446DMA_STREAM_cr stm32446_dma2_stream0_cr_inic(void);
void stm32446_dma2_stream0_ndt(uint16_t value);
void stm32446_dma2_stream0_par(volatile long unsigned int periferal_addr);
void stm32446_dma2_stream0_m0a(volatile long unsigned int mem0_addr);
void stm32446_dma2_stream0_m1a(volatile long unsigned int mem1_addr);
STM32446DMA_STREAM_fcr stm32446_dma2_stream0_fcr_inic(void);
STM32446DMA_STREAM_cr stm32446_dma2_stream1_cr_inic(void);
void stm32446_dma2_stream1_ndt(uint16_t value);
void stm32446_dma2_stream1_par(volatile long unsigned int periferal_addr);
void stm32446_dma2_stream1_m0a(volatile long unsigned int mem0_addr);
void stm32446_dma2_stream1_m1a(volatile long unsigned int mem1_addr);
STM32446DMA_STREAM_fcr stm32446_dma2_stream1_fcr_inic(void);
STM32446DMA_STREAM_cr stm32446_dma2_stream2_cr_inic(void);
void stm32446_dma2_stream2_ndt(uint16_t value);
void stm32446_dma2_stream2_par(volatile long unsigned int periferal_addr);
void stm32446_dma2_stream2_m0a(volatile long unsigned int mem0_addr);
void stm32446_dma2_stream2_m1a(volatile long unsigned int mem1_addr);
STM32446DMA_STREAM_fcr stm32446_dma2_stream2_fcr_inic(void);
STM32446DMA_STREAM_cr stm32446_dma2_stream3_cr_inic(void);
void stm32446_dma2_stream3_ndt(uint16_t value);
void stm32446_dma2_stream3_par(volatile long unsigned int periferal_addr);
void stm32446_dma2_stream3_m0a(volatile long unsigned int mem0_addr);
void stm32446_dma2_stream3_m1a(volatile long unsigned int mem1_addr);
STM32446DMA_STREAM_fcr stm32446_dma2_stream3_fcr_inic(void);
STM32446DMA_STREAM_cr stm32446_dma2_stream4_cr_inic(void);
void stm32446_dma2_stream4_ndt(uint16_t value);
void stm32446_dma2_stream4_par(volatile long unsigned int periferal_addr);
void stm32446_dma2_stream4_m0a(volatile long unsigned int mem0_addr);
void stm32446_dma2_stream4_m1a(volatile long unsigned int mem1_addr);
STM32446DMA_STREAM_fcr stm32446_dma2_stream4_fcr_inic(void);
STM32446DMA_STREAM_cr stm32446_dma2_stream5_cr_inic(void);
void stm32446_dma2_stream5_ndt(uint16_t value);
void stm32446_dma2_stream5_par(volatile long unsigned int periferal_addr);
void stm32446_dma2_stream5_m0a(volatile long unsigned int mem0_addr);
void stm32446_dma2_stream5_m1a(volatile long unsigned int mem1_addr);
STM32446DMA_STREAM_fcr stm32446_dma2_stream5_fcr_inic(void);
STM32446DMA_STREAM_cr stm32446_dma2_stream6_cr_inic(void);
void stm32446_dma2_stream6_ndt(uint16_t value);
void stm32446_dma2_stream6_par(volatile long unsigned int periferal_addr);
void stm32446_dma2_stream6_m0a(volatile long unsigned int mem0_addr);
void stm32446_dma2_stream6_m1a(volatile long unsigned int mem1_addr);
STM32446DMA_STREAM_fcr stm32446_dma2_stream6_fcr_inic(void);
STM32446DMA_STREAM_cr stm32446_dma2_stream7_cr_inic(void);
void stm32446_dma2_stream7_ndt(uint16_t value);
void stm32446_dma2_stream7_par(volatile long unsigned int periferal_addr);
void stm32446_dma2_stream7_m0a(volatile long unsigned int mem0_addr);
void stm32446_dma2_stream7_m1a(volatile long unsigned int mem1_addr);
STM32446DMA_STREAM_fcr stm32446_dma2_stream7_fcr_inic(void);
STM32446DMA_func stm32446_dma2_func_inic(void);
/*******************************************/
/*** DMA Procedure & Function Definition ***/
/*******************************************/
void STM32446Dma1Clock(uint8_t bool)
{
	if(bool){ RCC->AHB1ENR |= (1 << 21); }
	else{ RCC->AHB1ENR &= ~(1 << 21); }
}
void STM32446Dma2Clock(uint8_t bool)
{
	if(bool){ RCC->AHB1ENR |= (1 << 22); }
	else{ RCC->AHB1ENR &= ~(1 << 22); }
}
/********************************************/
/************* DMA1 Bit Mapping *************/
/********************************************/
// SR
uint8_t STM32446DMA1_sr_tcif(uint8_t stream_n)
{
	uint8_t value;
	switch(stream_n){
		case 0:
			value = readreg(DMA1->LISR, 1, 5);
		break;
		case 1:
			value = readreg(DMA1->LISR, 1, 11);
		break;
		case 2:
			value = readreg(DMA1->LISR, 1, 21);
		break;
		case 3:
			value = readreg(DMA1->LISR, 1, 27);
		break;
		case 4:
			value = readreg(DMA1->HISR, 1, 5);
		break;
		case 5:
			value = readreg(DMA1->HISR, 1, 11);
		break;
		case 6:
			value = readreg(DMA1->HISR, 1, 21);
		break;
		case 7:
			value = readreg(DMA1->HISR, 1, 27);
		break;
	default: break;
	}
	return value;
}
void STM32446DMA1_sr_clear_tcif(uint8_t stream_n)
{
	switch(stream_n){
		case 0:
			setreg(&DMA1->LIFCR, 1, 5, 1);
		break;
		case 1:
			setreg(&DMA1->LIFCR, 1, 11, 1);
		break;
		case 2:
			setreg(&DMA1->LIFCR, 1, 21, 1);
		break;
		case 3:
			setreg(&DMA1->LIFCR, 1, 27, 1);
		break;
		case 4:
			setreg(&DMA1->HIFCR, 1, 5, 1);
		break;
		case 5:
			setreg(&DMA1->HIFCR, 1, 11, 1);
		break;
		case 6:
			setreg(&DMA1->HIFCR, 1, 21, 1);
		break;
		case 7:
			setreg(&DMA1->HIFCR, 1, 27, 1);
		break;
		default: break;
	}
}
uint8_t STM32446DMA1_sr_htif(uint8_t stream_n)
{
	uint8_t value;
	switch(stream_n){
		case 0:
			value = readreg(DMA1->LISR, 1, 4);
		break;
		case 1:
			value = readreg(DMA1->LISR, 1, 10);
		break;
		case 2:
			value = readreg(DMA1->LISR, 1, 20);
		break;
		case 3:
			value = readreg(DMA1->LISR, 1, 26);
		break;
		case 4:
			value = readreg(DMA1->HISR, 1, 4);
		break;
		case 5:
			value = readreg(DMA1->HISR, 1, 10);
		break;
		case 6:
			value = readreg(DMA1->HISR, 1, 20);
		break;
		case 7:
			value = readreg(DMA1->HISR, 1, 26);
		break;
	default: break;
	}
	return value;
}
void STM32446DMA1_sr_clear_htif(uint8_t stream_n)
{
	switch(stream_n){
		case 0:
			setreg(&DMA1->LIFCR, 1, 4, 1);
		break;
		case 1:
			setreg(&DMA1->LIFCR, 1, 10, 1);
		break;
		case 2:
			setreg(&DMA1->LIFCR, 1, 20, 1);
		break;
		case 3:
			setreg(&DMA1->LIFCR, 1, 26, 1);
		break;
		case 4:
			setreg(&DMA1->HIFCR, 1, 4, 1);
		break;
		case 5:
			setreg(&DMA1->HIFCR, 1, 10, 1);
		break;
		case 6:
			setreg(&DMA1->HIFCR, 1, 20, 1);
		break;
		case 7:
			setreg(&DMA1->HIFCR, 1, 26, 1);
		break;
		default: break;
	}
}
uint8_t STM32446DMA1_sr_teif(uint8_t stream_n)
{
	uint8_t value;
	switch(stream_n){
		case 0:
			value = readreg(DMA1->LISR, 1, 3);
		break;
		case 1:
			value = readreg(DMA1->LISR, 1, 9);
		break;
		case 2:
			value = readreg(DMA1->LISR, 1, 19);
		break;
		case 3:
			value = readreg(DMA1->LISR, 1, 25);
		break;
		case 4:
			value = readreg(DMA1->HISR, 1, 3);
		break;
		case 5:
			value = readreg(DMA1->HISR, 1, 9);
		break;
		case 6:
			value = readreg(DMA1->HISR, 1, 19);
		break;
		case 7:
			value = readreg(DMA1->HISR, 1, 25);
		break;
	default: break;
	}
	return value;
}
void STM32446DMA1_sr_clear_teif(uint8_t stream_n)
{
	switch(stream_n){
		case 0:
			setreg(&DMA1->LIFCR, 1, 3, 1);
		break;
		case 1:
			setreg(&DMA1->LIFCR, 1, 9, 1);
		break;
		case 2:
			setreg(&DMA1->LIFCR, 1, 19, 1);
		break;
		case 3:
			setreg(&DMA1->LIFCR, 1, 25, 1);
		break;
		case 4:
			setreg(&DMA1->HIFCR, 1, 3, 1);
		break;
		case 5:
			setreg(&DMA1->HIFCR, 1, 9, 1);
		break;
		case 6:
			setreg(&DMA1->HIFCR, 1, 19, 1);
		break;
		case 7:
			setreg(&DMA1->HIFCR, 1, 25, 1);
		break;
		default: break;
	}
}
uint8_t STM32446DMA1_sr_dmeif(uint8_t stream_n)
{
	uint8_t value;
	switch(stream_n){
		case 0:
			value = readreg(DMA1->LISR, 1, 2);
		break;
		case 1:
			value = readreg(DMA1->LISR, 1, 8);
		break;
		case 2:
			value = readreg(DMA1->LISR, 1, 18);
		break;
		case 3:
			value = readreg(DMA1->LISR, 1, 24);
		break;
		case 4:
			value = readreg(DMA1->HISR, 1, 2);
		break;
		case 5:
			value = readreg(DMA1->HISR, 1, 8);
		break;
		case 6:
			value = readreg(DMA1->HISR, 1, 18);
		break;
		case 7:
			value = readreg(DMA1->HISR, 1, 24);
		break;
	default: break;
	}
	return value;
}
void STM32446DMA1_sr_clear_dmeif(uint8_t stream_n)
{
	switch(stream_n){
		case 0:
			setreg(&DMA1->LIFCR, 1, 2, 1);
		break;
		case 1:
			setreg(&DMA1->LIFCR, 1, 8, 1);
		break;
		case 2:
			setreg(&DMA1->LIFCR, 1, 18, 1);
		break;
		case 3:
			setreg(&DMA1->LIFCR, 1, 24, 1);
		break;
		case 4:
			setreg(&DMA1->HIFCR, 1, 2, 1);
		break;
		case 5:
			setreg(&DMA1->HIFCR, 1, 8, 1);
		break;
		case 6:
			setreg(&DMA1->HIFCR, 1, 18, 1);
		break;
		case 7:
			setreg(&DMA1->HIFCR, 1, 24, 1);
		break;
		default: break;
	}
}
uint8_t STM32446DMA1_sr_feif(uint8_t stream_n)
{
	uint8_t value;
	switch(stream_n){
		case 0:
			value = readreg(DMA1->LISR, 1, 0);
		break;
		case 1:
			value = readreg(DMA1->LISR, 1, 6);
		break;
		case 2:
			value = readreg(DMA1->LISR, 1, 16);
		break;
		case 3:
			value = readreg(DMA1->LISR, 1, 22);
		break;
		case 4:
			value = readreg(DMA1->HISR, 1, 0);
		break;
		case 5:
			value = readreg(DMA1->HISR, 1, 6);
		break;
		case 6:
			value = readreg(DMA1->HISR, 1, 16);
		break;
		case 7:
			value = readreg(DMA1->HISR, 1, 22);
		break;
	default: break;
	}
	return value;
}
void STM32446DMA1_sr_clear_feif(uint8_t stream_n)
{
	switch(stream_n){
		case 0:
			setreg(&DMA1->LIFCR, 1, 0, 1);
		break;
		case 1:
			setreg(&DMA1->LIFCR, 1, 6, 1);
		break;
		case 2:
			setreg(&DMA1->LIFCR, 1, 16, 1);
		break;
		case 3:
			setreg(&DMA1->LIFCR, 1, 22, 1);
		break;
		case 4:
			setreg(&DMA1->HIFCR, 1, 0, 1);
		break;
		case 5:
			setreg(&DMA1->HIFCR, 1, 6, 1);
		break;
		case 6:
			setreg(&DMA1->HIFCR, 1, 16, 1);
		break;
		case 7:
			setreg(&DMA1->HIFCR, 1, 22, 1);
		break;
		default: break;
	}
}
/*** Inic SR ***/
STM32446DMA_sr stm32446_dma1_sr_inic(void)
{
	STM32446DMA_sr stm32446_dma_sr;
	// SR
	stm32446_dma_sr.tcif = STM32446DMA1_sr_tcif;
	stm32446_dma_sr.clear_tcif = STM32446DMA1_sr_clear_tcif;
	stm32446_dma_sr.htif = STM32446DMA1_sr_htif;
	stm32446_dma_sr.clear_htif = STM32446DMA1_sr_clear_htif;
	stm32446_dma_sr.teif = STM32446DMA1_sr_teif;
	stm32446_dma_sr.clear_teif = STM32446DMA1_sr_clear_teif;
	stm32446_dma_sr.dmeif = STM32446DMA1_sr_dmeif;
	stm32446_dma_sr.clear_dmeif = STM32446DMA1_sr_clear_dmeif;
	stm32446_dma_sr.feif = STM32446DMA1_sr_feif;
	stm32446_dma_sr.clear_feif = STM32446DMA1_sr_clear_feif;
	return stm32446_dma_sr;
}
// DMA1 STREAM0 CR
void STM32446DMA1_stream0_cr_chsel(uint8_t value)
{
	setreg(&DMA1_Stream0->CR, 3, 25, value);
}
void STM32446DMA1_stream0_cr_mburst(uint8_t value)
{
	setreg(&DMA1_Stream0->CR, 2, 23, value);
}
void STM32446DMA1_stream0_cr_pburst(uint8_t value)
{
	setreg(&DMA1_Stream0->CR, 2, 21, value);
}
void STM32446DMA1_stream0_cr_ct(uint8_t bool)
{
	setreg(&DMA1_Stream0->CR, 1, 19, bool);
}
void STM32446DMA1_stream0_cr_dbm(uint8_t bool)
{
	setreg(&DMA1_Stream0->CR, 1, 18, bool);
}
void STM32446DMA1_stream0_cr_pl(uint8_t value)
{
	setreg(&DMA1_Stream0->CR, 2, 16, value);
}
void STM32446DMA1_stream0_cr_pincos(uint8_t bool)
{
	setreg(&DMA1_Stream0->CR, 1, 15, bool);
}
void STM32446DMA1_stream0_cr_msize(uint8_t value)
{
	setreg(&DMA1_Stream0->CR, 2, 13, value);
}
void STM32446DMA1_stream0_cr_psize(uint8_t value)
{
	setreg(&DMA1_Stream0->CR, 2, 11, value);
}
void STM32446DMA1_stream0_cr_minc(uint8_t bool)
{
	setreg(&DMA1_Stream0->CR, 1, 10, bool);
}
void STM32446DMA1_stream0_cr_pinc(uint8_t bool)
{
	setreg(&DMA1_Stream0->CR, 1, 9, bool);
}
void STM32446DMA1_stream0_cr_circ(uint8_t bool)
{
	setreg(&DMA1_Stream0->CR, 1, 8, bool);
}
void STM32446DMA1_stream0_cr_dir(uint8_t value)
{
	setreg(&DMA1_Stream0->CR, 2, 7, value);
}
void STM32446DMA1_stream0_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA1_Stream0->CR, 1, 5, bool);
}
void STM32446DMA1_stream0_cr_tcie(uint8_t bool)
{
	setreg(&DMA1_Stream0->CR, 1, 4, bool);
}
void STM32446DMA1_stream0_cr_htie(uint8_t bool)
{
	setreg(&DMA1_Stream0->CR, 1, 3, bool);
}
void STM32446DMA1_stream0_cr_teie(uint8_t bool)
{
	setreg(&DMA1_Stream0->CR, 1, 2, bool);
}
void STM32446DMA1_stream0_cr_dmeie(uint8_t bool)
{
	setreg(&DMA1_Stream0->CR, 1, 1, bool);
}
void STM32446DMA1_stream0_cr_en(uint8_t bool)
{
	setreg(&DMA1_Stream0->CR, 1, 0, bool);
}
/*** Inic DMA1 STREAM0 CR ***/
STM32446DMA_STREAM_cr stm32446_dma1_stream0_cr_inic(void)
{
	STM32446DMA_STREAM_cr stm32446_dma_stream_cr;
	// CR
	stm32446_dma_stream_cr.chsel = STM32446DMA1_stream0_cr_chsel;
	stm32446_dma_stream_cr.mburst = STM32446DMA1_stream0_cr_mburst;
	stm32446_dma_stream_cr.pburst = STM32446DMA1_stream0_cr_pburst;
	stm32446_dma_stream_cr.ct = STM32446DMA1_stream0_cr_ct;
	stm32446_dma_stream_cr.dbm = STM32446DMA1_stream0_cr_dbm;
	stm32446_dma_stream_cr.pl = STM32446DMA1_stream0_cr_pl;
	stm32446_dma_stream_cr.pincos = STM32446DMA1_stream0_cr_pincos;
	stm32446_dma_stream_cr.msize = STM32446DMA1_stream0_cr_msize;
	stm32446_dma_stream_cr.psize = STM32446DMA1_stream0_cr_psize;
	stm32446_dma_stream_cr.minc = STM32446DMA1_stream0_cr_minc;
	stm32446_dma_stream_cr.pinc = STM32446DMA1_stream0_cr_pinc;
	stm32446_dma_stream_cr.circ = STM32446DMA1_stream0_cr_circ;
	stm32446_dma_stream_cr.dir = STM32446DMA1_stream0_cr_dir;
	stm32446_dma_stream_cr.pfctrl = STM32446DMA1_stream0_cr_pfctrl;
	stm32446_dma_stream_cr.tcie = STM32446DMA1_stream0_cr_tcie;
	stm32446_dma_stream_cr.htie = STM32446DMA1_stream0_cr_htie;
	stm32446_dma_stream_cr.teie = STM32446DMA1_stream0_cr_teie;
	stm32446_dma_stream_cr.dmeie = STM32446DMA1_stream0_cr_dmeie;
	stm32446_dma_stream_cr.en = STM32446DMA1_stream0_cr_en;
	return stm32446_dma_stream_cr;
}
/*** Inic DMA1 STREAM0 Function ***/
void stm32446_dma1_stream0_ndt(uint16_t value)
{
	DMA1_Stream0->NDTR = value;
}
void stm32446_dma1_stream0_par(volatile long unsigned int periferal_addr)
{
	DMA1_Stream0->PAR = periferal_addr;
}
void stm32446_dma1_stream0_m0a(volatile long unsigned int mem0_addr)
{
	DMA1_Stream0->M0AR = mem0_addr;
}
void stm32446_dma1_stream0_m1a(volatile long unsigned int mem1_addr)
{
	DMA1_Stream0->M1AR = mem1_addr;
}
// DMA1 STREAM1 CR
void STM32446DMA1_stream1_cr_chsel(uint8_t value)
{
	setreg(&DMA1_Stream1->CR, 3, 25, value);
}
void STM32446DMA1_stream1_cr_mburst(uint8_t value)
{
	setreg(&DMA1_Stream1->CR, 2, 23, value);
}
void STM32446DMA1_stream1_cr_pburst(uint8_t value)
{
	setreg(&DMA1_Stream1->CR, 2, 21, value);
}
void STM32446DMA1_stream1_cr_ct(uint8_t bool)
{
	setreg(&DMA1_Stream1->CR, 1, 19, bool);
}
void STM32446DMA1_stream1_cr_dbm(uint8_t bool)
{
	setreg(&DMA1_Stream1->CR, 1, 18, bool);
}
void STM32446DMA1_stream1_cr_pl(uint8_t value)
{
	setreg(&DMA1_Stream1->CR, 2, 16, value);
}
void STM32446DMA1_stream1_cr_pincos(uint8_t bool)
{
	setreg(&DMA1_Stream1->CR, 1, 15, bool);
}
void STM32446DMA1_stream1_cr_msize(uint8_t value)
{
	setreg(&DMA1_Stream1->CR, 2, 13, value);
}
void STM32446DMA1_stream1_cr_psize(uint8_t value)
{
	setreg(&DMA1_Stream1->CR, 2, 11, value);
}
void STM32446DMA1_stream1_cr_minc(uint8_t bool)
{
	setreg(&DMA1_Stream1->CR, 1, 10, bool);
}
void STM32446DMA1_stream1_cr_pinc(uint8_t bool)
{
	setreg(&DMA1_Stream1->CR, 1, 9, bool);
}
void STM32446DMA1_stream1_cr_circ(uint8_t bool)
{
	setreg(&DMA1_Stream1->CR, 1, 8, bool);
}
void STM32446DMA1_stream1_cr_dir(uint8_t value)
{
	setreg(&DMA1_Stream1->CR, 2, 7, value);
}
void STM32446DMA1_stream1_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA1_Stream1->CR, 1, 5, bool);
}
void STM32446DMA1_stream1_cr_tcie(uint8_t bool)
{
	setreg(&DMA1_Stream1->CR, 1, 4, bool);
}
void STM32446DMA1_stream1_cr_htie(uint8_t bool)
{
	setreg(&DMA1_Stream1->CR, 1, 3, bool);
}
void STM32446DMA1_stream1_cr_teie(uint8_t bool)
{
	setreg(&DMA1_Stream1->CR, 1, 2, bool);
}
void STM32446DMA1_stream1_cr_dmeie(uint8_t bool)
{
	setreg(&DMA1_Stream1->CR, 1, 1, bool);
}
void STM32446DMA1_stream1_cr_en(uint8_t bool)
{
	setreg(&DMA1_Stream1->CR, 1, 0, bool);
}
/*** Inic DMA1 STREAM1 CR ***/
STM32446DMA_STREAM_cr stm32446_dma1_stream1_cr_inic(void)
{
	STM32446DMA_STREAM_cr stm32446_dma_stream_cr;
	// CR
	stm32446_dma_stream_cr.chsel = STM32446DMA1_stream1_cr_chsel;
	stm32446_dma_stream_cr.mburst = STM32446DMA1_stream1_cr_mburst;
	stm32446_dma_stream_cr.pburst = STM32446DMA1_stream1_cr_pburst;
	stm32446_dma_stream_cr.ct = STM32446DMA1_stream1_cr_ct;
	stm32446_dma_stream_cr.dbm = STM32446DMA1_stream1_cr_dbm;
	stm32446_dma_stream_cr.pl = STM32446DMA1_stream1_cr_pl;
	stm32446_dma_stream_cr.pincos = STM32446DMA1_stream1_cr_pincos;
	stm32446_dma_stream_cr.msize = STM32446DMA1_stream1_cr_msize;
	stm32446_dma_stream_cr.psize = STM32446DMA1_stream1_cr_psize;
	stm32446_dma_stream_cr.minc = STM32446DMA1_stream1_cr_minc;
	stm32446_dma_stream_cr.pinc = STM32446DMA1_stream1_cr_pinc;
	stm32446_dma_stream_cr.circ = STM32446DMA1_stream1_cr_circ;
	stm32446_dma_stream_cr.dir = STM32446DMA1_stream1_cr_dir;
	stm32446_dma_stream_cr.pfctrl = STM32446DMA1_stream1_cr_pfctrl;
	stm32446_dma_stream_cr.tcie = STM32446DMA1_stream1_cr_tcie;
	stm32446_dma_stream_cr.htie = STM32446DMA1_stream1_cr_htie;
	stm32446_dma_stream_cr.teie = STM32446DMA1_stream1_cr_teie;
	stm32446_dma_stream_cr.dmeie = STM32446DMA1_stream1_cr_dmeie;
	stm32446_dma_stream_cr.en = STM32446DMA1_stream1_cr_en;
	return stm32446_dma_stream_cr;
}
/*** Inic DMA1 STREAM1 Function ***/
void stm32446_dma1_stream1_ndt(uint16_t value)
{
	DMA1_Stream1->NDTR = value;
}
void stm32446_dma1_stream1_par(volatile long unsigned int periferal_addr)
{
	DMA1_Stream1->PAR = periferal_addr;
}
void stm32446_dma1_stream1_m0a(volatile long unsigned int mem0_addr)
{
	DMA1_Stream1->M0AR = mem0_addr;
}
void stm32446_dma1_stream1_m1a(volatile long unsigned int mem1_addr)
{
	DMA1_Stream1->M1AR = mem1_addr;
}
// DMA1 STREAM2 CR
void STM32446DMA1_stream2_cr_chsel(uint8_t value)
{
	setreg(&DMA1_Stream2->CR, 3, 25, value);
}
void STM32446DMA1_stream2_cr_mburst(uint8_t value)
{
	setreg(&DMA1_Stream2->CR, 2, 23, value);
}
void STM32446DMA1_stream2_cr_pburst(uint8_t value)
{
	setreg(&DMA1_Stream2->CR, 2, 21, value);
}
void STM32446DMA1_stream2_cr_ct(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 19, bool);
}
void STM32446DMA1_stream2_cr_dbm(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 18, bool);
}
void STM32446DMA1_stream2_cr_pl(uint8_t value)
{
	setreg(&DMA1_Stream2->CR, 2, 16, value);
}
void STM32446DMA1_stream2_cr_pincos(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 15, bool);
}
void STM32446DMA1_stream2_cr_msize(uint8_t value)
{
	setreg(&DMA1_Stream2->CR, 2, 13, value);
}
void STM32446DMA1_stream2_cr_psize(uint8_t value)
{
	setreg(&DMA1_Stream2->CR, 2, 11, value);
}
void STM32446DMA1_stream2_cr_minc(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 10, bool);
}
void STM32446DMA1_stream2_cr_pinc(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 9, bool);
}
void STM32446DMA1_stream2_cr_circ(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 8, bool);
}
void STM32446DMA1_stream2_cr_dir(uint8_t value)
{
	setreg(&DMA1_Stream2->CR, 2, 7, value);
}
void STM32446DMA1_stream2_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 5, bool);
}
void STM32446DMA1_stream2_cr_tcie(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 4, bool);
}
void STM32446DMA1_stream2_cr_htie(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 3, bool);
}
void STM32446DMA1_stream2_cr_teie(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 2, bool);
}
void STM32446DMA1_stream2_cr_dmeie(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 1, bool);
}
void STM32446DMA1_stream2_cr_en(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 0, bool);
}
/*** Inic DMA1 STREAM2 CR ***/
STM32446DMA_STREAM_cr stm32446_dma1_stream2_cr_inic(void)
{
	STM32446DMA_STREAM_cr stm32446_dma_stream_cr;
	// CR
	stm32446_dma_stream_cr.chsel = STM32446DMA1_stream2_cr_chsel;
	stm32446_dma_stream_cr.mburst = STM32446DMA1_stream2_cr_mburst;
	stm32446_dma_stream_cr.pburst = STM32446DMA1_stream2_cr_pburst;
	stm32446_dma_stream_cr.ct = STM32446DMA1_stream2_cr_ct;
	stm32446_dma_stream_cr.dbm = STM32446DMA1_stream2_cr_dbm;
	stm32446_dma_stream_cr.pl = STM32446DMA1_stream2_cr_pl;
	stm32446_dma_stream_cr.pincos = STM32446DMA1_stream2_cr_pincos;
	stm32446_dma_stream_cr.msize = STM32446DMA1_stream2_cr_msize;
	stm32446_dma_stream_cr.psize = STM32446DMA1_stream2_cr_psize;
	stm32446_dma_stream_cr.minc = STM32446DMA1_stream2_cr_minc;
	stm32446_dma_stream_cr.pinc = STM32446DMA1_stream2_cr_pinc;
	stm32446_dma_stream_cr.circ = STM32446DMA1_stream2_cr_circ;
	stm32446_dma_stream_cr.dir = STM32446DMA1_stream2_cr_dir;
	stm32446_dma_stream_cr.pfctrl = STM32446DMA1_stream2_cr_pfctrl;
	stm32446_dma_stream_cr.tcie = STM32446DMA1_stream2_cr_tcie;
	stm32446_dma_stream_cr.htie = STM32446DMA1_stream2_cr_htie;
	stm32446_dma_stream_cr.teie = STM32446DMA1_stream2_cr_teie;
	stm32446_dma_stream_cr.dmeie = STM32446DMA1_stream2_cr_dmeie;
	stm32446_dma_stream_cr.en = STM32446DMA1_stream2_cr_en;
	return stm32446_dma_stream_cr;
}
/*** Inic DMA1 STREAM2 Function ***/
void stm32446_dma1_stream2_ndt(uint16_t value)
{
	DMA1_Stream2->NDTR = value;
}
void stm32446_dma1_stream2_par(volatile long unsigned int periferal_addr)
{
