BitNibble/Source_Library/stm32f446lib/Library/Src/stm32446dma.c
	setreg(&DMA2_Stream3->CR, 2, 13, value);
}
void STM32446DMA2_stream3_cr_psize(uint8_t value)
{
	setreg(&DMA2_Stream3->CR, 2, 11, value);
}
void STM32446DMA2_stream3_cr_minc(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 10, bool);
}
void STM32446DMA2_stream3_cr_pinc(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 9, bool);
}
void STM32446DMA2_stream3_cr_circ(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 8, bool);
}
void STM32446DMA2_stream3_cr_dir(uint8_t value)
{
	setreg(&DMA2_Stream3->CR, 2, 7, value);
}
void STM32446DMA2_stream3_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 5, bool);
}
void STM32446DMA2_stream3_cr_tcie(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 4, bool);
}
void STM32446DMA2_stream3_cr_htie(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 3, bool);
}
void STM32446DMA2_stream3_cr_teie(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 2, bool);
}
void STM32446DMA2_stream3_cr_dmeie(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 1, bool);
}
void STM32446DMA2_stream3_cr_en(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 0, bool);
}
/*** Inic DMA2 STREAM3 CR ***/
STM32446DMA_STREAM_cr stm32446_dma2_stream3_cr_inic(void)
{
	STM32446DMA_STREAM_cr stm32446_dma_stream_cr;
	// CR
	stm32446_dma_stream_cr.chsel = STM32446DMA2_stream3_cr_chsel;
	stm32446_dma_stream_cr.mburst = STM32446DMA2_stream3_cr_mburst;
	stm32446_dma_stream_cr.pburst = STM32446DMA2_stream3_cr_pburst;
	stm32446_dma_stream_cr.ct = STM32446DMA2_stream3_cr_ct;
	stm32446_dma_stream_cr.dbm = STM32446DMA2_stream3_cr_dbm;
	stm32446_dma_stream_cr.pl = STM32446DMA2_stream3_cr_pl;
	stm32446_dma_stream_cr.pincos = STM32446DMA2_stream3_cr_pincos;
	stm32446_dma_stream_cr.msize = STM32446DMA2_stream3_cr_msize;
	stm32446_dma_stream_cr.psize = STM32446DMA2_stream3_cr_psize;
	stm32446_dma_stream_cr.minc = STM32446DMA2_stream3_cr_minc;
	stm32446_dma_stream_cr.pinc = STM32446DMA2_stream3_cr_pinc;
	stm32446_dma_stream_cr.circ = STM32446DMA2_stream3_cr_circ;
	stm32446_dma_stream_cr.dir = STM32446DMA2_stream3_cr_dir;
	stm32446_dma_stream_cr.pfctrl = STM32446DMA2_stream3_cr_pfctrl;
	stm32446_dma_stream_cr.tcie = STM32446DMA2_stream3_cr_tcie;
	stm32446_dma_stream_cr.htie = STM32446DMA2_stream3_cr_htie;
	stm32446_dma_stream_cr.teie = STM32446DMA2_stream3_cr_teie;
	stm32446_dma_stream_cr.dmeie = STM32446DMA2_stream3_cr_dmeie;
	stm32446_dma_stream_cr.en = STM32446DMA2_stream3_cr_en;
	return stm32446_dma_stream_cr;
}
/*** Inic DMA2 STREAM3 Function ***/
void stm32446_dma2_stream3_ndt(uint16_t value)
{
	DMA2_Stream3->NDTR = value;
}
void stm32446_dma2_stream3_par(volatile long unsigned int periferal_addr)
{
	DMA2_Stream3->PAR = periferal_addr;
}
void stm32446_dma2_stream3_m0a(volatile long unsigned int mem0_addr)
{
	DMA2_Stream3->M0AR = mem0_addr;
}
void stm32446_dma2_stream3_m1a(volatile long unsigned int mem1_addr)
{
	DMA2_Stream3->M1AR = mem1_addr;
}
// DMA2 STREAM4 CR
void STM32446DMA2_stream4_cr_chsel(uint8_t value)
{
	setreg(&DMA2_Stream4->CR, 3, 25, value);
}
void STM32446DMA2_stream4_cr_mburst(uint8_t value)
{
	setreg(&DMA2_Stream4->CR, 2, 23, value);
}
void STM32446DMA2_stream4_cr_pburst(uint8_t value)
{
	setreg(&DMA2_Stream4->CR, 2, 21, value);
}
void STM32446DMA2_stream4_cr_ct(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 19, bool);
}
void STM32446DMA2_stream4_cr_dbm(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 18, bool);
}
void STM32446DMA2_stream4_cr_pl(uint8_t value)
{
	setreg(&DMA2_Stream4->CR, 2, 16, value);
}
void STM32446DMA2_stream4_cr_pincos(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 15, bool);
}
void STM32446DMA2_stream4_cr_msize(uint8_t value)
{
	setreg(&DMA2_Stream4->CR, 2, 13, value);
}
void STM32446DMA2_stream4_cr_psize(uint8_t value)
{
	setreg(&DMA2_Stream4->CR, 2, 11, value);
}
void STM32446DMA2_stream4_cr_minc(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 10, bool);
}
void STM32446DMA2_stream4_cr_pinc(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 9, bool);
}
void STM32446DMA2_stream4_cr_circ(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 8, bool);
}
void STM32446DMA2_stream4_cr_dir(uint8_t value)
{
	setreg(&DMA2_Stream4->CR, 2, 7, value);
}
void STM32446DMA2_stream4_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 5, bool);
}
void STM32446DMA2_stream4_cr_tcie(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 4, bool);
}
void STM32446DMA2_stream4_cr_htie(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 3, bool);
}
void STM32446DMA2_stream4_cr_teie(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 2, bool);
}
void STM32446DMA2_stream4_cr_dmeie(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 1, bool);
}
void STM32446DMA2_stream4_cr_en(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 0, bool);
}
/*** Inic DMA2 STREAM4 CR ***/
STM32446DMA_STREAM_cr stm32446_dma2_stream4_cr_inic(void)
{
	STM32446DMA_STREAM_cr stm32446_dma_stream_cr;
	// CR
	stm32446_dma_stream_cr.chsel = STM32446DMA2_stream4_cr_chsel;
	stm32446_dma_stream_cr.mburst = STM32446DMA2_stream4_cr_mburst;
	stm32446_dma_stream_cr.pburst = STM32446DMA2_stream4_cr_pburst;
	stm32446_dma_stream_cr.ct = STM32446DMA2_stream4_cr_ct;
	stm32446_dma_stream_cr.dbm = STM32446DMA2_stream4_cr_dbm;
	stm32446_dma_stream_cr.pl = STM32446DMA2_stream4_cr_pl;
	stm32446_dma_stream_cr.pincos = STM32446DMA2_stream4_cr_pincos;
	stm32446_dma_stream_cr.msize = STM32446DMA2_stream4_cr_msize;
	stm32446_dma_stream_cr.psize = STM32446DMA2_stream4_cr_psize;
	stm32446_dma_stream_cr.minc = STM32446DMA2_stream4_cr_minc;
	stm32446_dma_stream_cr.pinc = STM32446DMA2_stream4_cr_pinc;
	stm32446_dma_stream_cr.circ = STM32446DMA2_stream4_cr_circ;
	stm32446_dma_stream_cr.dir = STM32446DMA2_stream4_cr_dir;
	stm32446_dma_stream_cr.pfctrl = STM32446DMA2_stream4_cr_pfctrl;
	stm32446_dma_stream_cr.tcie = STM32446DMA2_stream4_cr_tcie;
	stm32446_dma_stream_cr.htie = STM32446DMA2_stream4_cr_htie;
	stm32446_dma_stream_cr.teie = STM32446DMA2_stream4_cr_teie;
	stm32446_dma_stream_cr.dmeie = STM32446DMA2_stream4_cr_dmeie;
	stm32446_dma_stream_cr.en = STM32446DMA2_stream4_cr_en;
	return stm32446_dma_stream_cr;
}
/*** Inic DMA2 STREAM4 Function ***/
void stm32446_dma2_stream4_ndt(uint16_t value)
{
	DMA2_Stream4->NDTR = value;
}
void stm32446_dma2_stream4_par(volatile long unsigned int periferal_addr)
{
	DMA2_Stream4->PAR = periferal_addr;
}
void stm32446_dma2_stream4_m0a(volatile long unsigned int mem0_addr)
{
	DMA2_Stream4->M0AR = mem0_addr;
}
void stm32446_dma2_stream4_m1a(volatile long unsigned int mem1_addr)
{
	DMA2_Stream4->M1AR = mem1_addr;
}
// DMA2 STREAM5 CR
void STM32446DMA2_stream5_cr_chsel(uint8_t value)
{
	setreg(&DMA2_Stream5->CR, 3, 25, value);
}
void STM32446DMA2_stream5_cr_mburst(uint8_t value)
{
	setreg(&DMA2_Stream5->CR, 2, 23, value);
}
void STM32446DMA2_stream5_cr_pburst(uint8_t value)
{
	setreg(&DMA2_Stream5->CR, 2, 21, value);
}
void STM32446DMA2_stream5_cr_ct(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 19, bool);
}
void STM32446DMA2_stream5_cr_dbm(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 18, bool);
}
void STM32446DMA2_stream5_cr_pl(uint8_t value)
{
	setreg(&DMA2_Stream5->CR, 2, 16, value);
}
void STM32446DMA2_stream5_cr_pincos(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 15, bool);
}
void STM32446DMA2_stream5_cr_msize(uint8_t value)
{
	setreg(&DMA2_Stream5->CR, 2, 13, value);
}
void STM32446DMA2_stream5_cr_psize(uint8_t value)
{
	setreg(&DMA2_Stream5->CR, 2, 11, value);
}
void STM32446DMA2_stream5_cr_minc(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 10, bool);
}
void STM32446DMA2_stream5_cr_pinc(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 9, bool);
}
void STM32446DMA2_stream5_cr_circ(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 8, bool);
}
void STM32446DMA2_stream5_cr_dir(uint8_t value)
{
	setreg(&DMA2_Stream5->CR, 2, 7, value);
}
void STM32446DMA2_stream5_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 5, bool);
}
void STM32446DMA2_stream5_cr_tcie(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 4, bool);
}
void STM32446DMA2_stream5_cr_htie(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 3, bool);
}
void STM32446DMA2_stream5_cr_teie(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 2, bool);
}
void STM32446DMA2_stream5_cr_dmeie(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 1, bool);
}
void STM32446DMA2_stream5_cr_en(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 0, bool);
}
/*** Inic DMA2 STREAM5 CR ***/
STM32446DMA_STREAM_cr stm32446_dma2_stream5_cr_inic(void)
{
	STM32446DMA_STREAM_cr stm32446_dma_stream_cr;
	// CR
	stm32446_dma_stream_cr.chsel = STM32446DMA2_stream5_cr_chsel;
	stm32446_dma_stream_cr.mburst = STM32446DMA2_stream5_cr_mburst;
	stm32446_dma_stream_cr.pburst = STM32446DMA2_stream5_cr_pburst;
	stm32446_dma_stream_cr.ct = STM32446DMA2_stream5_cr_ct;
	stm32446_dma_stream_cr.dbm = STM32446DMA2_stream5_cr_dbm;
	stm32446_dma_stream_cr.pl = STM32446DMA2_stream5_cr_pl;
	stm32446_dma_stream_cr.pincos = STM32446DMA2_stream5_cr_pincos;
	stm32446_dma_stream_cr.msize = STM32446DMA2_stream5_cr_msize;
	stm32446_dma_stream_cr.psize = STM32446DMA2_stream5_cr_psize;
	stm32446_dma_stream_cr.minc = STM32446DMA2_stream5_cr_minc;
	stm32446_dma_stream_cr.pinc = STM32446DMA2_stream5_cr_pinc;
	stm32446_dma_stream_cr.circ = STM32446DMA2_stream5_cr_circ;
	stm32446_dma_stream_cr.dir = STM32446DMA2_stream5_cr_dir;
	stm32446_dma_stream_cr.pfctrl = STM32446DMA2_stream5_cr_pfctrl;
	stm32446_dma_stream_cr.tcie = STM32446DMA2_stream5_cr_tcie;
	stm32446_dma_stream_cr.htie = STM32446DMA2_stream5_cr_htie;
	stm32446_dma_stream_cr.teie = STM32446DMA2_stream5_cr_teie;
	stm32446_dma_stream_cr.dmeie = STM32446DMA2_stream5_cr_dmeie;
	stm32446_dma_stream_cr.en = STM32446DMA2_stream5_cr_en;
	return stm32446_dma_stream_cr;
}
/*** Inic DMA2 STREAM5 Function ***/
void stm32446_dma2_stream5_ndt(uint16_t value)
{
	DMA2_Stream5->NDTR = value;
}
void stm32446_dma2_stream5_par(volatile long unsigned int periferal_addr)
{
	DMA2_Stream5->PAR = periferal_addr;
}
void stm32446_dma2_stream5_m0a(volatile long unsigned int mem0_addr)
{
	DMA2_Stream5->M0AR = mem0_addr;
}
void stm32446_dma2_stream5_m1a(volatile long unsigned int mem1_addr)
{
	DMA2_Stream5->M1AR = mem1_addr;
}
// DMA2 STREAM6 CR
void STM32446DMA2_stream6_cr_chsel(uint8_t value)
{
	setreg(&DMA2_Stream6->CR, 3, 25, value);
}
void STM32446DMA2_stream6_cr_mburst(uint8_t value)
{
	setreg(&DMA2_Stream6->CR, 2, 23, value);
}
void STM32446DMA2_stream6_cr_pburst(uint8_t value)
{
	setreg(&DMA2_Stream6->CR, 2, 21, value);
}
void STM32446DMA2_stream6_cr_ct(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 19, bool);
}
void STM32446DMA2_stream6_cr_dbm(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 18, bool);
}
void STM32446DMA2_stream6_cr_pl(uint8_t value)
{
	setreg(&DMA2_Stream6->CR, 2, 16, value);
}
void STM32446DMA2_stream6_cr_pincos(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 15, bool);
}
void STM32446DMA2_stream6_cr_msize(uint8_t value)
{
	setreg(&DMA2_Stream6->CR, 2, 13, value);
}
void STM32446DMA2_stream6_cr_psize(uint8_t value)
{
	setreg(&DMA2_Stream6->CR, 2, 11, value);
}
void STM32446DMA2_stream6_cr_minc(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 10, bool);
}
void STM32446DMA2_stream6_cr_pinc(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 9, bool);
}
void STM32446DMA2_stream6_cr_circ(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 8, bool);
}
void STM32446DMA2_stream6_cr_dir(uint8_t value)
{
	setreg(&DMA2_Stream6->CR, 2, 7, value);
}
void STM32446DMA2_stream6_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 5, bool);
}
void STM32446DMA2_stream6_cr_tcie(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 4, bool);
}
void STM32446DMA2_stream6_cr_htie(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 3, bool);
}
void STM32446DMA2_stream6_cr_teie(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 2, bool);
}
void STM32446DMA2_stream6_cr_dmeie(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 1, bool);
}
void STM32446DMA2_stream6_cr_en(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 0, bool);
}
/*** Inic DMA2 STREAM6 CR ***/
STM32446DMA_STREAM_cr stm32446_dma2_stream6_cr_inic(void)
{
	STM32446DMA_STREAM_cr stm32446_dma_stream_cr;
	// CR
	stm32446_dma_stream_cr.chsel = STM32446DMA2_stream6_cr_chsel;
	stm32446_dma_stream_cr.mburst = STM32446DMA2_stream6_cr_mburst;
	stm32446_dma_stream_cr.pburst = STM32446DMA2_stream6_cr_pburst;
	stm32446_dma_stream_cr.ct = STM32446DMA2_stream6_cr_ct;
	stm32446_dma_stream_cr.dbm = STM32446DMA2_stream6_cr_dbm;
	stm32446_dma_stream_cr.pl = STM32446DMA2_stream6_cr_pl;
	stm32446_dma_stream_cr.pincos = STM32446DMA2_stream6_cr_pincos;
	stm32446_dma_stream_cr.msize = STM32446DMA2_stream6_cr_msize;
	stm32446_dma_stream_cr.psize = STM32446DMA2_stream6_cr_psize;
	stm32446_dma_stream_cr.minc = STM32446DMA2_stream6_cr_minc;
	stm32446_dma_stream_cr.pinc = STM32446DMA2_stream6_cr_pinc;
	stm32446_dma_stream_cr.circ = STM32446DMA2_stream6_cr_circ;
	stm32446_dma_stream_cr.dir = STM32446DMA2_stream6_cr_dir;
	stm32446_dma_stream_cr.pfctrl = STM32446DMA2_stream6_cr_pfctrl;
	stm32446_dma_stream_cr.tcie = STM32446DMA2_stream6_cr_tcie;
	stm32446_dma_stream_cr.htie = STM32446DMA2_stream6_cr_htie;
	stm32446_dma_stream_cr.teie = STM32446DMA2_stream6_cr_teie;
	stm32446_dma_stream_cr.dmeie = STM32446DMA2_stream6_cr_dmeie;
	stm32446_dma_stream_cr.en = STM32446DMA2_stream6_cr_en;
	return stm32446_dma_stream_cr;
}
/*** Inic DMA2 STREAM6 Function ***/
void stm32446_dma2_stream6_ndt(uint16_t value)
{
	DMA2_Stream6->NDTR = value;
}
void stm32446_dma2_stream6_par(volatile long unsigned int periferal_addr)
{
	DMA2_Stream6->PAR = periferal_addr;
}
void stm32446_dma2_stream6_m0a(volatile long unsigned int mem0_addr)
{
	DMA2_Stream6->M0AR = mem0_addr;
}
void stm32446_dma2_stream6_m1a(volatile long unsigned int mem1_addr)
{
	DMA2_Stream6->M1AR = mem1_addr;
}
// DMA2 STREAM7 CR
void STM32446DMA2_stream7_cr_chsel(uint8_t value)
{
	setreg(&DMA2_Stream7->CR, 3, 25, value);
}
void STM32446DMA2_stream7_cr_mburst(uint8_t value)
{
	setreg(&DMA2_Stream7->CR, 2, 23, value);
}
void STM32446DMA2_stream7_cr_pburst(uint8_t value)
{
	setreg(&DMA2_Stream7->CR, 2, 21, value);
}
void STM32446DMA2_stream7_cr_ct(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 19, bool);
}
void STM32446DMA2_stream7_cr_dbm(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 18, bool);
}
void STM32446DMA2_stream7_cr_pl(uint8_t value)
{
	setreg(&DMA2_Stream7->CR, 2, 16, value);
}
void STM32446DMA2_stream7_cr_pincos(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 15, bool);
}
void STM32446DMA2_stream7_cr_msize(uint8_t value)
{
	setreg(&DMA2_Stream7->CR, 2, 13, value);
}
void STM32446DMA2_stream7_cr_psize(uint8_t value)
{
	setreg(&DMA2_Stream7->CR, 2, 11, value);
}
void STM32446DMA2_stream7_cr_minc(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 10, bool);
}
void STM32446DMA2_stream7_cr_pinc(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 9, bool);
}
void STM32446DMA2_stream7_cr_circ(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 8, bool);
}
void STM32446DMA2_stream7_cr_dir(uint8_t value)
{
	setreg(&DMA2_Stream7->CR, 2, 7, value);
}
void STM32446DMA2_stream7_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 5, bool);
}
void STM32446DMA2_stream7_cr_tcie(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 4, bool);
}
void STM32446DMA2_stream7_cr_htie(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 3, bool);
}
void STM32446DMA2_stream7_cr_teie(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 2, bool);
}
void STM32446DMA2_stream7_cr_dmeie(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 1, bool);
}
void STM32446DMA2_stream7_cr_en(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 0, bool);
}
/*** Inic DMA2 STREAM7 CR ***/
STM32446DMA_STREAM_cr stm32446_dma2_stream7_cr_inic(void)
{
	STM32446DMA_STREAM_cr stm32446_dma_stream_cr;
	// CR
	stm32446_dma_stream_cr.chsel = STM32446DMA2_stream7_cr_chsel;
	stm32446_dma_stream_cr.mburst = STM32446DMA2_stream7_cr_mburst;
	stm32446_dma_stream_cr.pburst = STM32446DMA2_stream7_cr_pburst;
	stm32446_dma_stream_cr.ct = STM32446DMA2_stream7_cr_ct;
	stm32446_dma_stream_cr.dbm = STM32446DMA2_stream7_cr_dbm;
	stm32446_dma_stream_cr.pl = STM32446DMA2_stream7_cr_pl;
	stm32446_dma_stream_cr.pincos = STM32446DMA2_stream7_cr_pincos;
	stm32446_dma_stream_cr.msize = STM32446DMA2_stream7_cr_msize;
	stm32446_dma_stream_cr.psize = STM32446DMA2_stream7_cr_psize;
	stm32446_dma_stream_cr.minc = STM32446DMA2_stream7_cr_minc;
	stm32446_dma_stream_cr.pinc = STM32446DMA2_stream7_cr_pinc;
	stm32446_dma_stream_cr.circ = STM32446DMA2_stream7_cr_circ;
	stm32446_dma_stream_cr.dir = STM32446DMA2_stream7_cr_dir;
	stm32446_dma_stream_cr.pfctrl = STM32446DMA2_stream7_cr_pfctrl;
	stm32446_dma_stream_cr.tcie = STM32446DMA2_stream7_cr_tcie;
	stm32446_dma_stream_cr.htie = STM32446DMA2_stream7_cr_htie;
	stm32446_dma_stream_cr.teie = STM32446DMA2_stream7_cr_teie;
	stm32446_dma_stream_cr.dmeie = STM32446DMA2_stream7_cr_dmeie;
	stm32446_dma_stream_cr.en = STM32446DMA2_stream7_cr_en;
	return stm32446_dma_stream_cr;
}
/*** Inic DMA2 STREAM7 Function ***/
void stm32446_dma2_stream7_ndt(uint16_t value)
{
	DMA2_Stream7->NDTR = value;
}
void stm32446_dma2_stream7_par(volatile long unsigned int periferal_addr)
{
	DMA2_Stream7->PAR = periferal_addr;
}
void stm32446_dma2_stream7_m0a(volatile long unsigned int mem0_addr)
{
	DMA2_Stream7->M0AR = mem0_addr;
}
void stm32446_dma2_stream7_m1a(volatile long unsigned int mem1_addr)
{
	DMA2_Stream7->M1AR = mem1_addr;
}
// DMA2 STREAM0 FCR
void STM32446DMA2_stream0_fcr_feie(uint8_t bool)
{
	setreg(&DMA2_Stream0->FCR, 1, 7, bool);
}
void STM32446DMA2_stream0_fcr_fs(uint8_t value)
{
	setreg(&DMA2_Stream0->FCR, 3, 3, value);
}
void STM32446DMA2_stream0_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA2_Stream0->FCR, 1, 2, bool);
}
void STM32446DMA2_stream0_fcr_fth(uint8_t value)
{
	setreg(&DMA2_Stream0->FCR, 2, 0, value);
}
/*** Inic DMA2 STREAM0 FCR ***/
STM32446DMA_STREAM_fcr stm32446_dma2_stream0_fcr_inic(void)
{
	STM32446DMA_STREAM_fcr stm32446_dma_stream_fcr;
	// FCR
	stm32446_dma_stream_fcr.feie = STM32446DMA2_stream0_fcr_feie;
	stm32446_dma_stream_fcr.fs = STM32446DMA2_stream0_fcr_fs;
	stm32446_dma_stream_fcr.dmdis = STM32446DMA2_stream0_fcr_dmdis;
	stm32446_dma_stream_fcr.fth = STM32446DMA2_stream0_fcr_fth;
	return stm32446_dma_stream_fcr;
}
// DMA2 STREAM1 FCR
void STM32446DMA2_stream1_fcr_feie(uint8_t bool)
{
	setreg(&DMA2_Stream1->FCR, 1, 7, bool);
}
void STM32446DMA2_stream1_fcr_fs(uint8_t value)
{
	setreg(&DMA2_Stream1->FCR, 3, 3, value);
}
void STM32446DMA2_stream1_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA2_Stream1->FCR, 1, 2, bool);
}
void STM32446DMA2_stream1_fcr_fth(uint8_t value)
{
	setreg(&DMA2_Stream1->FCR, 2, 0, value);
}
/*** Inic DMA2 STREAM1 FCR ***/
STM32446DMA_STREAM_fcr stm32446_dma2_stream1_fcr_inic(void)
{
	STM32446DMA_STREAM_fcr stm32446_dma_stream_fcr;
	// FCR
	stm32446_dma_stream_fcr.feie = STM32446DMA2_stream1_fcr_feie;
	stm32446_dma_stream_fcr.fs = STM32446DMA2_stream1_fcr_fs;
	stm32446_dma_stream_fcr.dmdis = STM32446DMA2_stream1_fcr_dmdis;
	stm32446_dma_stream_fcr.fth = STM32446DMA2_stream1_fcr_fth;
	return stm32446_dma_stream_fcr;
}
// DMA2 STREAM2 FCR
void STM32446DMA2_stream2_fcr_feie(uint8_t bool)
{
	setreg(&DMA2_Stream2->FCR, 1, 7, bool);
}
void STM32446DMA2_stream2_fcr_fs(uint8_t value)
{
	setreg(&DMA2_Stream2->FCR, 3, 3, value);
}
void STM32446DMA2_stream2_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA2_Stream2->FCR, 1, 2, bool);
}
void STM32446DMA2_stream2_fcr_fth(uint8_t value)
{
	setreg(&DMA2_Stream2->FCR, 2, 0, value);
}
/*** Inic DMA2 STREAM2 FCR ***/
STM32446DMA_STREAM_fcr stm32446_dma2_stream2_fcr_inic(void)
{
	STM32446DMA_STREAM_fcr stm32446_dma_stream_fcr;
	// FCR
	stm32446_dma_stream_fcr.feie = STM32446DMA2_stream2_fcr_feie;
	stm32446_dma_stream_fcr.fs = STM32446DMA2_stream2_fcr_fs;
	stm32446_dma_stream_fcr.dmdis = STM32446DMA2_stream2_fcr_dmdis;
	stm32446_dma_stream_fcr.fth = STM32446DMA2_stream2_fcr_fth;
	return stm32446_dma_stream_fcr;
}
// DMA2 STREAM3 FCR
void STM32446DMA2_stream3_fcr_feie(uint8_t bool)
{
	setreg(&DMA2_Stream3->FCR, 1, 7, bool);
}
void STM32446DMA2_stream3_fcr_fs(uint8_t value)
{
	setreg(&DMA2_Stream3->FCR, 3, 3, value);
}
void STM32446DMA2_stream3_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA2_Stream3->FCR, 1, 2, bool);
}
void STM32446DMA2_stream3_fcr_fth(uint8_t value)
{
	setreg(&DMA2_Stream3->FCR, 2, 0, value);
}
/*** Inic DMA2 STREAM3 FCR ***/
STM32446DMA_STREAM_fcr stm32446_dma2_stream3_fcr_inic(void)
{
	STM32446DMA_STREAM_fcr stm32446_dma_stream_fcr;
	// FCR
	stm32446_dma_stream_fcr.feie = STM32446DMA2_stream3_fcr_feie;
	stm32446_dma_stream_fcr.fs = STM32446DMA2_stream3_fcr_fs;
	stm32446_dma_stream_fcr.dmdis = STM32446DMA2_stream3_fcr_dmdis;
	stm32446_dma_stream_fcr.fth = STM32446DMA2_stream3_fcr_fth;
	return stm32446_dma_stream_fcr;
}
// DMA1 STREAM4 FCR
void STM32446DMA2_stream4_fcr_feie(uint8_t bool)
{
	setreg(&DMA2_Stream4->FCR, 1, 7, bool);
}
void STM32446DMA2_stream4_fcr_fs(uint8_t value)
{
	setreg(&DMA2_Stream4->FCR, 3, 3, value);
}
void STM32446DMA2_stream4_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA2_Stream4->FCR, 1, 2, bool);
}
void STM32446DMA2_stream4_fcr_fth(uint8_t value)
{
	setreg(&DMA2_Stream4->FCR, 2, 0, value);
}
/*** Inic DMA2 STREAM4 FCR ***/
STM32446DMA_STREAM_fcr stm32446_dma2_stream4_fcr_inic(void)
{
	STM32446DMA_STREAM_fcr stm32446_dma_stream_fcr;
	// FCR
	stm32446_dma_stream_fcr.feie = STM32446DMA2_stream4_fcr_feie;
	stm32446_dma_stream_fcr.fs = STM32446DMA2_stream4_fcr_fs;
	stm32446_dma_stream_fcr.dmdis = STM32446DMA2_stream4_fcr_dmdis;
	stm32446_dma_stream_fcr.fth = STM32446DMA2_stream4_fcr_fth;
	return stm32446_dma_stream_fcr;
}
// DMA1 STREAM5 FCR
void STM32446DMA2_stream5_fcr_feie(uint8_t bool)
{
	setreg(&DMA2_Stream5->FCR, 1, 7, bool);
}
void STM32446DMA2_stream5_fcr_fs(uint8_t value)
{
	setreg(&DMA2_Stream5->FCR, 3, 3, value);
}
void STM32446DMA2_stream5_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA2_Stream5->FCR, 1, 2, bool);
}
void STM32446DMA2_stream5_fcr_fth(uint8_t value)
{
	setreg(&DMA2_Stream5->FCR, 2, 0, value);
}
/*** Inic DMA2 STREAM5 FCR ***/
STM32446DMA_STREAM_fcr stm32446_dma2_stream5_fcr_inic(void)
{
	STM32446DMA_STREAM_fcr stm32446_dma_stream_fcr;
	// FCR
	stm32446_dma_stream_fcr.feie = STM32446DMA2_stream5_fcr_feie;
	stm32446_dma_stream_fcr.fs = STM32446DMA2_stream5_fcr_fs;
	stm32446_dma_stream_fcr.dmdis = STM32446DMA2_stream5_fcr_dmdis;
	stm32446_dma_stream_fcr.fth = STM32446DMA2_stream5_fcr_fth;
	return stm32446_dma_stream_fcr;
}
// DMA1 STREAM6 FCR
void STM32446DMA2_stream6_fcr_feie(uint8_t bool)
{
	setreg(&DMA2_Stream6->FCR, 1, 7, bool);
}
void STM32446DMA2_stream6_fcr_fs(uint8_t value)
{
	setreg(&DMA2_Stream6->FCR, 3, 3, value);
}
void STM32446DMA2_stream6_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA2_Stream6->FCR, 1, 2, bool);
}
void STM32446DMA2_stream6_fcr_fth(uint8_t value)
{
	setreg(&DMA2_Stream6->FCR, 2, 0, value);
}
/*** Inic DMA2 STREAM6 FCR ***/
STM32446DMA_STREAM_fcr stm32446_dma2_stream6_fcr_inic(void)
{
	STM32446DMA_STREAM_fcr stm32446_dma_stream_fcr;
	// FCR
	stm32446_dma_stream_fcr.feie = STM32446DMA2_stream6_fcr_feie;
	stm32446_dma_stream_fcr.fs = STM32446DMA2_stream6_fcr_fs;
	stm32446_dma_stream_fcr.dmdis = STM32446DMA2_stream6_fcr_dmdis;
	stm32446_dma_stream_fcr.fth = STM32446DMA2_stream6_fcr_fth;
	return stm32446_dma_stream_fcr;
}
// DMA2 STREAM0 FCR
void STM32446DMA2_stream7_fcr_feie(uint8_t bool)
{
	setreg(&DMA2_Stream7->FCR, 1, 7, bool);
}
void STM32446DMA2_stream7_fcr_fs(uint8_t value)
{
	setreg(&DMA2_Stream7->FCR, 3, 3, value);
}
void STM32446DMA2_stream7_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA2_Stream7->FCR, 1, 2, bool);
}
void STM32446DMA2_stream7_fcr_fth(uint8_t value)
{
	setreg(&DMA2_Stream7->FCR, 2, 0, value);
}
/*** Inic DMA2 STREAM7 FCR ***/
STM32446DMA_STREAM_fcr stm32446_dma2_stream7_fcr_inic(void)
{
	STM32446DMA_STREAM_fcr stm32446_dma_stream_fcr;
	// FCR
	stm32446_dma_stream_fcr.feie = STM32446DMA2_stream7_fcr_feie;
	stm32446_dma_stream_fcr.fs = STM32446DMA2_stream7_fcr_fs;
	stm32446_dma_stream_fcr.dmdis = STM32446DMA2_stream7_fcr_dmdis;
	stm32446_dma_stream_fcr.fth = STM32446DMA2_stream7_fcr_fth;
	return stm32446_dma_stream_fcr;
}
/*** FUNC ***/
