BitNibble/Source_Library/stm32f446lib/Library/Src/stm32446dma.c
void dma2_circ_cfg(volatile long unsigned int* p_addr, volatile long unsigned int* m_addr, uint8_t stream_n, uint8_t channel_n, uint16_t quant_d, uint8_t p_size, uint8_t m_size, uint8_t priority, uint8_t dir)
{
	// Filter to Default
	if(stream_n > 7){ stream_n = 0;}
	if(channel_n > 7){ channel_n = 0;}
	if(quant_d > 65535){ quant_d = 1;}
	if(p_size > 2){ p_size = 0;}
	if(m_size > 2){ m_size = 0;}
	if(priority > 3){ priority = 0;}
	if( p_addr && m_addr ){
		/*** Verify Ready for Parameter ***/
		setreg(&(DMA2_Stream0 + stream_n)->CR, 1, 0, 0);
		for(time_out = 200; readreg((DMA2_Stream0 + stream_n)->CR, 1, 0) && time_out; time_out--);
		/*** Parameter Configure ***/
		(DMA2_Stream0 + stream_n)->PAR = (volatile long unsigned int) p_addr;
		(DMA2_Stream0 + stream_n)->M0AR = (volatile long unsigned int) m_addr;
		setreg(&(DMA2_Stream0 + stream_n)->CR, 1, 5, 0); // 0 -> dma, 1 -> peri
		setreg(&(DMA2_Stream0 + stream_n)->CR, 3, 25, channel_n); // channel
		(DMA2_Stream0 + stream_n)->NDTR = quant_d; //
		setreg(&(DMA2_Stream0 + stream_n)->CR, 2, 13, m_size); // msize 2 -> 32bit
		setreg(&(DMA2_Stream0 + stream_n)->CR, 2, 11, p_size); // psize 1 -> 16bit
		setreg(&(DMA2_Stream0 + stream_n)->CR, 2, 16, priority); // priority
		if(dir){
			setreg(&(DMA2_Stream0 + stream_n)->CR, 2, 6, 1); // DIR
			setreg(&(DMA2_Stream0 + stream_n)->CR, 1, 9, 1); // PINC
			setreg(&(DMA2_Stream0 + stream_n)->CR, 1, 10, 0); // MINC
		}else{
			setreg(&(DMA2_Stream0 + stream_n)->CR, 2, 6, 0); // DIR
			setreg(&(DMA2_Stream0 + stream_n)->CR, 1, 9, 0); // PINC
			setreg(&(DMA2_Stream0 + stream_n)->CR, 1, 10, 1); // MINC
		}
		setreg(&(DMA2_Stream0 + stream_n)->CR, 1, 8, 1); // CIRC
		setreg(&(DMA2_Stream0 + stream_n)->CR, 1, 0, 1); // ENABLE
	}
}
/*** Inic FUNC ***/
STM32446DMA_func stm32446_dma2_func_inic(void)
{
	STM32446DMA_func stm32446_dma_func;

	stm32446_dma_func.circ_cfg = dma2_circ_cfg;

	return stm32446_dma_func;
}
/****************************************************/
/**** DMA2 INIC Procedure & Function Definition *****/
/****************************************************/
STM32446DMA2obj dma2_inic(void)
{
	STM32446DMA2obj stm32446_dma;
	stm32446_dma.reg = DMA2;
	stm32446_dma.stream[0].reg = DMA2_Stream0;
	/*** DMA2 Bit Mapping Link ***/
	stm32446_dma.sr = stm32446_dma2_sr_inic();
	stm32446_dma.stream[0].cr = stm32446_dma2_stream0_cr_inic();
	stm32446_dma.stream[0].fcr = stm32446_dma2_stream0_fcr_inic();
	stm32446_dma.stream[0].ndt = stm32446_dma2_stream0_ndt;
	stm32446_dma.stream[0].par = stm32446_dma2_stream0_par;
	stm32446_dma.stream[0].m0a = stm32446_dma2_stream0_m0a;
	stm32446_dma.stream[0].m1a = stm32446_dma2_stream0_m1a;
	stm32446_dma.stream[1].cr = stm32446_dma2_stream1_cr_inic();
	stm32446_dma.stream[1].fcr = stm32446_dma2_stream1_fcr_inic();
	stm32446_dma.stream[1].ndt = stm32446_dma2_stream1_ndt;
	stm32446_dma.stream[1].par = stm32446_dma2_stream1_par;
	stm32446_dma.stream[1].m0a = stm32446_dma2_stream1_m0a;
	stm32446_dma.stream[1].m1a = stm32446_dma2_stream1_m1a;
	stm32446_dma.stream[2].cr = stm32446_dma2_stream2_cr_inic();
	stm32446_dma.stream[2].fcr = stm32446_dma2_stream2_fcr_inic();
	stm32446_dma.stream[2].ndt = stm32446_dma2_stream2_ndt;
	stm32446_dma.stream[2].par = stm32446_dma2_stream2_par;
	stm32446_dma.stream[2].m0a = stm32446_dma2_stream2_m0a;
	stm32446_dma.stream[2].m1a = stm32446_dma2_stream2_m1a;
	stm32446_dma.stream[3].cr = stm32446_dma2_stream3_cr_inic();
	stm32446_dma.stream[3].fcr = stm32446_dma2_stream3_fcr_inic();
	stm32446_dma.stream[3].ndt = stm32446_dma2_stream3_ndt;
	stm32446_dma.stream[3].par = stm32446_dma2_stream3_par;
	stm32446_dma.stream[3].m0a = stm32446_dma2_stream3_m0a;
	stm32446_dma.stream[3].m1a = stm32446_dma2_stream3_m1a;
	stm32446_dma.stream[4].cr = stm32446_dma2_stream4_cr_inic();
	stm32446_dma.stream[4].fcr = stm32446_dma2_stream4_fcr_inic();
	stm32446_dma.stream[4].ndt = stm32446_dma2_stream4_ndt;
	stm32446_dma.stream[4].par = stm32446_dma2_stream4_par;
	stm32446_dma.stream[4].m0a = stm32446_dma2_stream4_m0a;
	stm32446_dma.stream[4].m1a = stm32446_dma2_stream4_m1a;
	stm32446_dma.stream[5].cr = stm32446_dma2_stream5_cr_inic();
	stm32446_dma.stream[5].fcr = stm32446_dma2_stream5_fcr_inic();
	stm32446_dma.stream[5].ndt = stm32446_dma2_stream5_ndt;
	stm32446_dma.stream[5].par = stm32446_dma2_stream5_par;
	stm32446_dma.stream[5].m0a = stm32446_dma2_stream5_m0a;
	stm32446_dma.stream[5].m1a = stm32446_dma2_stream5_m1a;
	stm32446_dma.stream[6].cr = stm32446_dma2_stream6_cr_inic();
	stm32446_dma.stream[6].fcr = stm32446_dma2_stream6_fcr_inic();
	stm32446_dma.stream[6].ndt = stm32446_dma2_stream6_ndt;
	stm32446_dma.stream[6].par = stm32446_dma2_stream6_par;
	stm32446_dma.stream[6].m0a = stm32446_dma2_stream6_m0a;
	stm32446_dma.stream[6].m1a = stm32446_dma2_stream6_m1a;
	stm32446_dma.stream[7].cr = stm32446_dma2_stream7_cr_inic();
	stm32446_dma.stream[7].fcr = stm32446_dma2_stream7_fcr_inic();
	stm32446_dma.stream[7].ndt = stm32446_dma2_stream7_ndt;
	stm32446_dma.stream[7].par = stm32446_dma2_stream7_par;
	stm32446_dma.stream[7].m0a = stm32446_dma2_stream7_m0a;
	stm32446_dma.stream[7].m1a = stm32446_dma2_stream7_m1a;
	/*** Other ***/
	stm32446_dma.func = stm32446_dma2_func_inic();
	stm32446_dma.clock = STM32446Dma2Clock;
	return stm32446_dma;
}

/*** EOF ***/

/******
1º Sequence
2º Scope
	- Library Scope
	- File Scope
	- Function Scope
	- Precedence Scope
3º Pointer and Variable
4º Casting
******/


